maxboss10086/max_dsp/max/F28388D/6_clb_generate_clk/device/driverlib/inc/hw_clb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_0 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_0_IN0_S    0U
#define CLB_OUTPUT_LUT_0_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_0_IN1_S    5U
#define CLB_OUTPUT_LUT_0_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_0_IN2_S    10U
#define CLB_OUTPUT_LUT_0_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_0_FN_S     15U
#define CLB_OUTPUT_LUT_0_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_1 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_1_IN0_S    0U
#define CLB_OUTPUT_LUT_1_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_1_IN1_S    5U
#define CLB_OUTPUT_LUT_1_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_1_IN2_S    10U
#define CLB_OUTPUT_LUT_1_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_1_FN_S     15U
#define CLB_OUTPUT_LUT_1_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_2 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_2_IN0_S    0U
#define CLB_OUTPUT_LUT_2_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_2_IN1_S    5U
#define CLB_OUTPUT_LUT_2_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_2_IN2_S    10U
#define CLB_OUTPUT_LUT_2_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_2_FN_S     15U
#define CLB_OUTPUT_LUT_2_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_3 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_3_IN0_S    0U
#define CLB_OUTPUT_LUT_3_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_IN1_S    5U
#define CLB_OUTPUT_LUT_3_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_IN2_S    10U
#define CLB_OUTPUT_LUT_3_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_FN_S     15U
#define CLB_OUTPUT_LUT_3_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_4 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_4_IN0_S    0U
#define CLB_OUTPUT_LUT_4_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_IN1_S    5U
#define CLB_OUTPUT_LUT_4_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_IN2_S    10U
#define CLB_OUTPUT_LUT_4_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_FN_S     15U
#define CLB_OUTPUT_LUT_4_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_5 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_5_IN0_S    0U
#define CLB_OUTPUT_LUT_5_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_IN1_S    5U
#define CLB_OUTPUT_LUT_5_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_IN2_S    10U
#define CLB_OUTPUT_LUT_5_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_FN_S     15U
#define CLB_OUTPUT_LUT_5_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_6 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_6_IN0_S    0U
#define CLB_OUTPUT_LUT_6_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_IN1_S    5U
#define CLB_OUTPUT_LUT_6_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_IN2_S    10U
#define CLB_OUTPUT_LUT_6_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_FN_S     15U
#define CLB_OUTPUT_LUT_6_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_7 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_7_IN0_S    0U
#define CLB_OUTPUT_LUT_7_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_IN1_S    5U
#define CLB_OUTPUT_LUT_7_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_IN2_S    10U
#define CLB_OUTPUT_LUT_7_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_FN_S     15U
#define CLB_OUTPUT_LUT_7_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_HLC_EVENT_SEL register
//
//*****************************************************************************
#define CLB_HLC_EVENT_SEL_EVENT0_SEL_S  0U
#define CLB_HLC_EVENT_SEL_EVENT0_SEL_M  0x1FU        // Event Select 0
#define CLB_HLC_EVENT_SEL_EVENT1_SEL_S  5U
#define CLB_HLC_EVENT_SEL_EVENT1_SEL_M  0x3E0U       // Event Select 1
#define CLB_HLC_EVENT_SEL_EVENT2_SEL_S  10U
#define CLB_HLC_EVENT_SEL_EVENT2_SEL_M  0x7C00U      // Event Select 2
#define CLB_HLC_EVENT_SEL_EVENT3_SEL_S  15U
#define CLB_HLC_EVENT_SEL_EVENT3_SEL_M  0xF8000U     // Event Select 3
#define CLB_HLC_EVENT_SEL_ALT_EVENT0_SEL  0x100000U    // Event Select 3
#define CLB_HLC_EVENT_SEL_ALT_EVENT1_SEL  0x200000U    // Event Select 3
#define CLB_HLC_EVENT_SEL_ALT_EVENT2_SEL  0x400000U    // Event Select 3
#define CLB_HLC_EVENT_SEL_ALT_EVENT3_SEL  0x800000U    // Event Select 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_COUNT_MATCH_TAP_SEL register
//
//*****************************************************************************
#define CLB_COUNT_MATCH_TAP_SEL_COUNT0_MATCH1_S  0U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT0_MATCH1_M  0x1FU        // Match1 tap select for Counter
                                               // 0
#define CLB_COUNT_MATCH_TAP_SEL_COUNT1_MATCH1_S  5U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT1_MATCH1_M  0x3E0U       // Match1 tap select for Counter
                                               // 1
#define CLB_COUNT_MATCH_TAP_SEL_COUNT2_MATCH1_S  10U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT2_MATCH1_M  0x7C00U      // Match1 tap select for Counter
                                               // 2
#define CLB_COUNT_MATCH_TAP_SEL_COUNT0_MATCH2_S  16U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT0_MATCH2_M  0x1F0000U    // Match2 tap select for Counter
                                               // 0
#define CLB_COUNT_MATCH_TAP_SEL_COUNT1_MATCH2_S  21U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT1_MATCH2_M  0x3E00000U   // Match2 tap select for Counter
                                               // 1
#define CLB_COUNT_MATCH_TAP_SEL_COUNT2_MATCH2_S  26U
#define CLB_COUNT_MATCH_TAP_SEL_COUNT2_MATCH2_M  0x7C000000U  // Match2 tap select for Counter
                                               // 2

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_0 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_0_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_0_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_0_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_0_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_0_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_0_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_0_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_0_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_0_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_0_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_0_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_0_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_0_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_1 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_1_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_1_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_1_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_1_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_1_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_1_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_1_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_1_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_1_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_1_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_1_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_1_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_1_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_2 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_2_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_2_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_2_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_2_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_2_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_2_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_2_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_2_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_2_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_2_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_2_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_2_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_2_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_3 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_3_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_3_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_3_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_3_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_3_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_3_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_3_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_3_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_3_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_3_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_3_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_3_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_3_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_4 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_4_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_4_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_4_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_4_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_4_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_4_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_4_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_4_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_4_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_4_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_4_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_4_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_4_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_5 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_5_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_5_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_5_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_5_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_5_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_5_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_5_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_5_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_5_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_5_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_5_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_5_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_5_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_6 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_6_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_6_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_6_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_6_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_6_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_6_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_6_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_6_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_6_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_6_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_6_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_6_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_6_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_COND_CTRL_7 register
//
//*****************************************************************************
#define CLB_OUTPUT_COND_CTRL_7_LEVEL_1_SEL  0x1U         // Level 1 Mux Select
#define CLB_OUTPUT_COND_CTRL_7_LEVEL_2_SEL_S  1U
#define CLB_OUTPUT_COND_CTRL_7_LEVEL_2_SEL_M  0x6U         // Level 2 Mux Select
#define CLB_OUTPUT_COND_CTRL_7_LEVEL_3_SEL_S  3U
#define CLB_OUTPUT_COND_CTRL_7_LEVEL_3_SEL_M  0x18U        // Level 3 Mux Select
#define CLB_OUTPUT_COND_CTRL_7_SEL_GATING_CTRL_S  5U
#define CLB_OUTPUT_COND_CTRL_7_SEL_GATING_CTRL_M  0xE0U        // Gating control mux select
#define CLB_OUTPUT_COND_CTRL_7_SEL_RELEASE_CTRL_S  8U
#define CLB_OUTPUT_COND_CTRL_7_SEL_RELEASE_CTRL_M  0x700U       // Releast control mux select
#define CLB_OUTPUT_COND_CTRL_7_HW_GATING_CTRL_SEL  0x800U       // Select HW for gating control
#define CLB_OUTPUT_COND_CTRL_7_HW_RLS_CTRL_SEL  0x1000U      // Select HW for release control
#define CLB_OUTPUT_COND_CTRL_7_SEL_RAW_IN  0x2000U      // Select Input for
#define CLB_OUTPUT_COND_CTRL_7_ASYNC_COND_EN  0x4000U      // Enable for conditioning

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_MISC_ACCESS_CTRL register
//
//*****************************************************************************
#define CLB_MISC_ACCESS_CTRL_SPIEN  0x1U         // Enable CLB SPI Buffer feature
#define CLB_MISC_ACCESS_CTRL_BLKEN  0x2U         // Block Register write

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_SPI_DATA_CTRL_HI register
//
//*****************************************************************************
#define CLB_SPI_DATA_CTRL_HI_STRB_S  0U
#define CLB_SPI_DATA_CTRL_HI_STRB_M  0x1FU        // Select value for strobe
#define CLB_SPI_DATA_CTRL_HI_SHIFT_S  8U
#define CLB_SPI_DATA_CTRL_HI_SHIFT_M  0x1F00U      // Shift value select

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LOAD_EN register
//
//*****************************************************************************
#define CLB_LOAD_EN_LOAD_EN       0x1U         // Load Enable
#define CLB_LOAD_EN_GLOBAL_EN     0x2U         // Global Enable
#define CLB_LOAD_EN_STOP          0x4U         // Debug stop control
#define CLB_LOAD_EN_NMI_EN        0x8U         // NMI output enable
#define CLB_LOAD_EN_PIPELINE_EN   0x10U        // Enable input pipelining

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LOAD_ADDR register
//
//*****************************************************************************
#define CLB_LOAD_ADDR_ADDR_S      0U
#define CLB_LOAD_ADDR_ADDR_M      0x3FU        // Indirect Address

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_INPUT_FILTER register
//
//*****************************************************************************
#define CLB_INPUT_FILTER_FIN0_S   0U
#define CLB_INPUT_FILTER_FIN0_M   0x3U         // Input filter control 0
#define CLB_INPUT_FILTER_FIN1_S   2U
#define CLB_INPUT_FILTER_FIN1_M   0xCU         // Input filter control 1
#define CLB_INPUT_FILTER_FIN2_S   4U
#define CLB_INPUT_FILTER_FIN2_M   0x30U        // Input filter control 2
#define CLB_INPUT_FILTER_FIN3_S   6U
#define CLB_INPUT_FILTER_FIN3_M   0xC0U        // Input filter control 3
#define CLB_INPUT_FILTER_FIN4_S   8U
#define CLB_INPUT_FILTER_FIN4_M   0x300U       // Input filter control 4
#define CLB_INPUT_FILTER_FIN5_S   10U
#define CLB_INPUT_FILTER_FIN5_M   0xC00U       // Input filter control 5
#define CLB_INPUT_FILTER_FIN6_S   12U
#define CLB_INPUT_FILTER_FIN6_M   0x3000U      // Input filter control 6
#define CLB_INPUT_FILTER_FIN7_S   14U
#define CLB_INPUT_FILTER_FIN7_M   0xC000U      // Input filter control 7
#define CLB_INPUT_FILTER_SYNC0    0x10000U     // Synchronizer control 0
#define CLB_INPUT_FILTER_SYNC1    0x20000U     // Synchronizer control 1
#define CLB_INPUT_FILTER_SYNC2    0x40000U     // Synchronizer control 2
#define CLB_INPUT_FILTER_SYNC3    0x80000U     // Synchronizer control 3
#define CLB_INPUT_FILTER_SYNC4    0x100000U    // Synchronizer control 4
#define CLB_INPUT_FILTER_SYNC5    0x200000U    // Synchronizer control 5
#define CLB_INPUT_FILTER_SYNC6    0x400000U    // Synchronizer control 6
#define CLB_INPUT_FILTER_SYNC7    0x800000U    // Synchronizer control 7
#define CLB_INPUT_FILTER_PIPE0    0x1000000U   // Enable pipeline 0
#define CLB_INPUT_FILTER_PIPE1    0x2000000U   // Enable pipeline 1
#define CLB_INPUT_FILTER_PIPE2    0x4000000U   // Enable pipeline 2
#define CLB_INPUT_FILTER_PIPE3    0x8000000U   // Enable pipeline 3
#define CLB_INPUT_FILTER_PIPE4    0x10000000U  // Enable pipeline 4
#define CLB_INPUT_FILTER_PIPE5    0x20000000U  // Enable pipeline 5
#define CLB_INPUT_FILTER_PIPE6    0x40000000U  // Enable pipeline 6
#define CLB_INPUT_FILTER_PIPE7    0x80000000U  // Enable pipeline 7

